stressTest.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "1 RPS"
    - duration: 2
      arrivalRate: 10
      name: "10 RPS"
    - duration: 3
      arrivalRate: 100
      name: "100 RPS"
    - duration: 4
      arrivalRate: 1000
      name: "1,000 RPS (goal)"
  processor: "./fakeHomeID.js"

scenarios:
  - name: "Emulate page load"
    flow:
      # call fakeHomeID() to supply id
      - function: "fakeHomeID"
      - get:
          url: "/MoreHomes/?id={{ id }}"